ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_usbfs_dev_drv_io.c
/*******************************************************************************
* Function Name: AddEndpointHwBuffer
****************************************************************************//**
*
* Implements \ref Cy_USBFS_Dev_Drv_AddEndpoint for 
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU and 
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA modes.
*
* \param base
* The pointer to the USBFS instance.
*
* \param config
* The pointer to data endpoint configuration \ref cy_stc_usb_dev_ep_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device 
* operation for internal configuration and data retention. The user must not 
* modify anything in this structure.
*
* \return
* The status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t AddEndpointHwBuffer(USBFS_Type *base,
                                                 cy_stc_usb_dev_ep_config_t const *config,
                                                 cy_stc_usbfs_dev_drv_context_t   *context)
{
    uint32_t endpoint = EPADDR2PHY(config->endpointAddr);

    /* Gets a pointer to the endpoint data */
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint]; 

    /* Gets a buffer for the endpoint using the hardware buffer */
    if (config->allocBuffer)
    {
        uint32_t bufOffset;

        /* Gets a buffer for the endpoint */
        cy_en_usbfs_dev_drv_status_t retStatus = GetEndpointBuffer((uint32_t) config->bufferSize, &bufOffset, context);
        if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
        {
            return retStatus;
        }

        /* Sets the Arbiter read and write pointers */
        endpointData->startBuf = (uint16_t) bufOffset;
        Cy_USBFS_Dev_Drv_SetArbWriteAddr(base, endpoint, bufOffset);
        Cy_USBFS_Dev_Drv_SetArbReadAddr (base, endpoint, bufOffset);
    }

    /* Enables the endpoint for the operation */
    if (config->enableEndpoint)
    {
        bool inDirection = IS_EP_DIR_IN(config->endpointAddr);

        /* Configures the endpoint */
        endpointData->state   = CY_USB_DEV_EP_IDLE;
        endpointData->address = config->endpointAddr;
        endpointData->toggle  = 0U;
        endpointData->bufferSize = config->maxPacketSize;
        endpointData->sieMode = GetEndpointActiveMode(inDirection, config->attributes);
        endpointData->isPending = false;

        /* Sets an arbiter configuration (clears DMA requests) */
        Cy_USBFS_Dev_Drv_SetArbEpConfig(base, endpoint, (USBFS_USBDEV_ARB_EP1_CFG_CRC_BYPASS_Msk |
                                                         USBFS_USBDEV_ARB_EP1_CFG_RESET_PTR_Msk));

        /* Flushes the IN endpoint buffer to discard the loaded data. 
        * It happens when: an alternate settings change is requested and the IN 
        * endpoint buffer is full (not read by the Host).
        */
        if (inDirection)
        {
            Cy_USBFS_Dev_Drv_FlushInBuffer(base, endpoint);
        }

        /* Enables the endpoint arbiter interrupt sources */
        if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA == context->mode)
        {
            /* Configures the DMA based on the endpoint direction */
            cy_en_usbfs_dev_drv_status_t retStatus = DmaEndpointInit(base, context->mode, context->useReg16, &context->epPool[endpoint]);
            if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
            {
                return retStatus;
            }

            /* Enables the arbiter interrupt sources for the endpoint */
            Cy_USBFS_Dev_Drv_SetArbEpInterruptMask(base, endpoint, (inDirection ?
                                                                    IN_ENDPOINT_ARB_INTR_SOURCES_DMA :
                                                                    OUT_ENDPOINT_ARB_INTR_SOURCES_DMA));

            /* Enables the arbiter interrupt for the endpoint */
            Cy_USBFS_Dev_Drv_EnableArbEpInterrupt(base, endpoint);
        }
        else
        {
            /* Enables the error interrupt triggered by SIE */
            Cy_USBFS_Dev_Drv_SetArbEpInterruptMask(base, endpoint, ENDPOINT_ARB_INTR_SOURCES_CPU);
        }

        /* Enables the SIE interrupt for the endpoint */
        Cy_USBFS_Dev_Drv_EnableSieEpInterrupt(base, endpoint);

        /* Sets endpoint mode to not respond to the host */
        Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, GetEndpointInactiveMode((uint32_t) endpointData->sieMode));
    }

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_RemoveEndpoint
****************************************************************************//**
*
* Removes a data endpoint (release hardware resources allocated by data endpoint).
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpointAddr
* The data endpoint address (7 bit - direction, 3-0 bits - endpoint number).
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device 
* operation for internal configuration and data retention. The user must not 
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t Cy_USBFS_Dev_Drv_RemoveEndpoint(USBFS_Type *base,
                                                             uint32_t    endpointAddr,
                                                             cy_stc_usbfs_dev_drv_context_t *context)
{
    uint32_t endpoint = EPADDR2EP(endpointAddr);

    /* Checks if the endpoint is supported by the driver */
    if (false == IS_EP_VALID(endpoint))
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    endpoint = EP2PHY(endpoint);

